<template>
  <div>
    <h1>================= 【最简单的方式】 ===================</h1>
    <!-- 这里是VUE学习方案说明文档： -->
    <!-- 问题一：VUE处理数组，字符串数据，【数组拆减】【数组拼接】 -->
    <h2>参考案例: login.vue登录页面:</h2>
    <!-- 

        /** 【数组拆减】模拟字符串：*/
        var timeString = "星期一 星期二 星期三 星期四 星期五 星期六 星期天";
        // =============================================================================================
        /** 1.>>>字符串转换数组：split(按照什么字符/元素拆分) */
        var timeArray = timeString.split(" ");
        /** 得到的结果：["星期一", "星期二", "星期三", "星期四", "星期五", "星期六", "星期天"] */

        // =============================================================================================
        /** 2.>>>字符数组删除元素，【filter()方法】介绍：其他及下标方案不做介绍！  */
        var newTimeArray = timeArray.filter(item => item !== "action");
        /** 得到的结果：["星期一", "星期二", "星期三", "星期四", "星期六", "星期天"] */
        /** filter()方法返回的是一个新数组。方法参数通过表达式的方式返回一个没有“星期五”的新数组。
          通过过滤的方式对于简单的数组这个几乎效率问题不用在意，除非是非常庞大的一个数组
          或是一个有逻辑计算等的复杂数组。
        */
        
        // =============================================================================================
        /** 3.>>>字符数组转换为字符串，【join(按照什么字符/元素拼接)方法】介绍：其他及下标方案不做介绍！  */
        var newTimeString = newTimeArray.join("，");
        /** 得到的结果："星期一，星期二，星期三，星期四，星期六，星期天"; */
        /** join()方法返回的是一个字符串。主要就是减少我们使用循环这些冗余的代码！同样尽量不要操作大型的数组。

    -->
    <!--  -->
    <!--  -->
    <!--  -->
  </div>
</template>
